/*
	标准格式化 - 标志
*/
#include <stdio.h>

int main(void)
{
    printf("%d %d\n", 200, -200);  // 200  -200

    // '+'  显示正负号
    printf("%+d %+d\n", 200, -200);  // +200  -200

    // 200 前面有一个空格
    printf("[% d]\n", 200);  // [ 200]

    // 右对齐
    printf("[%10d]\n", 200);  // [       200]
    // '-'  左对齐
    printf("[%-10d]\n", 200);  // [200       ]

    // '0'  用 0 填补空白
    printf("[%010d]\n", 200);  // [0000000200]

    // '#' 可以让进制添加前缀, 八进制显示 0, 十六进制显示 0x 或 0X
    printf("%#o\n", 200);  // 0310
    printf("%#x\n", 200);  // 0xc8
    printf("%#X\n", 200);  // 0XC8

    return 0;
}