#include <stdio.h>  
/*
	位运算
	<<  按位左移, 空位补 0
*/
int main(void)
{
	char a = 13;
	char b = 13;
	char c = -13;

	// 补码左移 2 位
	a <<= 2; // a = a << 2
	printf("a = %d\n", a);  // 52


	// 补码左移 4 位
	b <<= 4;
	printf("b = %d\n", b);  // -48

	// 补码左移 4 位
	c <<= 4;
	printf("c = %d\n", c);  // 48


	return 0;
}
/*		 求  13 << 2
     十进制  13
	 13(原)  0000 1101
	 13(补)  0000 1101
	    <<2  
	res(补)  0011 0100
	res(原)  0011 0100
	 十进制  52

-----------------------------

	     求  13 << 4
	 十进制  13
	 13(原)  0000 1101
	 13(补)  0000 1101
		<<4  
	res(补)  1101 0000
	res(原)  1011 0000
	 十进制  -48

-----------------------------

	     求  -13 << 4
	 十进制  -13
	-13(原)  1000 1101
	-13(补)  1111 0011
		<<4
	res(补)  0011 0000
	res(原)  0011 0000
	 十进制  48
*/