/*
	按位异或
	相同为 0, 不同为 1
*/

#include <stdio.h>

/**
	使用位运算交换两个整数的值
	a 指向第一个整数的指针
	b 指向第二个整数的指针

	& -> 取地址 ( "给我这个变量的地址" )
	* -> 取值 ( "去这个地址里看看/改改" )
	&变量 -> 表示该变量的地址 ( 指针 )
	*指针 -> 表示该指针指向的值
 */
void swap_with_xor(char *a, char *b) {
	// 如果两个变量的地址相同直接返回 (因为如果地址相同, 那么指向的值肯定相同)
	if (a == b) return;

	// 交换两个指针指向的值
	*a ^= *b;
	*b ^= *a;
	*a ^= *b;
}

int main(void)
{
	char a = 0, b = 0;

	scanf("%hhd %hhd", &a, &b);

	printf("%d ^ %d = %d\n", a, b, a ^ b);


	printf("交换前 a = %d, b = %d\n", a , b);
	// 参数是指针地址
	swap_with_xor(&a, &b);
	printf("交换后 a = %d, b = %d\n", a, b);

	return 0;
}
/*
	
	     求  13 ^ 7
	 十进制  13
	 13(原)  0000 1101
	 13(补)  0000 1101
	 十进制  7
	  7(原)  0000 0111
	  7(补)  0000 0111

	 13(补)  0000 1101
		  ^
	  7(补)  0000 0111
	res(补)  0000 1010
	res(原)  0000 1010
	 十进制  10
-----------------------------

		 求  -13 ^ -7
	 十进制  -13
	-13(原)  1000 1101
	-13(补)  1111 0011
	十进制  -7
	 -7(原)  1000 0111
	 -7(补)  1111 1001

	-13(补)  1111 0011
		  ^
	 -7(补)  1111 1001
	res(补)  0000 1010
	res(原)  0000 1010
	 十进制  10
*/