#include <stdio.h>  
/*
	位运算
	>>  按位右移, 空位补符号位
	正数补 0, 负数补 1
*/
int main(void)
{
	char a = 13;
	char b = -13;

	a >>= 4; 
	printf("a = %d\n", a);  // 1

	b >>= 4;
	printf("b = %d\n", b);  // -1

	return 0;
}
/*
	     求  13 >> 4
	 十进制  13
	 13(原)  0000 1101
	 13(补)  0000 1101
		>>4  
	res(补)  0000 0000 ( 补符号位 0 )
	res(原)  0000 0000
	 十进制  0

-----------------------------

	     求  -13 >> 4
	 十进制  -13
	-13(原)  1000 1101
	-13(补)  1111 0011
		>>4
	res(补)  1111 1111 ( 补符号位 1 )
	res(原)  1000 0001
	 十进制  -1
*/