/*
	标准格式化 - 整数类型
*/
#include <stdio.h>

int main(void)
{
	printf("%d\n", 200);  // 200
	printf("%i\n", 200);  // 200
	// "200u" ( u 是 unsigned 的缩写 )表示无符号整数 200
	printf("%u\n", 200u);  // 200
	/*
		-200u 并不是 "负200的无符号版本"，而是对无符号字面量 200u 进行一元负操作，
		这会导致整数溢出，产生一个巨大的无符号数。
	*/
	printf("%u\n", -200u);  // 4294967096
	printf("%o\n", 200);  // 310
	printf("%x\n", 200);  // c8
	printf("%X\n", 200);  // C8
	
	return 0;
}
/*
	`%d` (或 `%i`)  有符号十进制整数
	`%u`   无符号十进制整数
	`%o`   无符号八进制整数
	`%x`   无符号十六进制整数 ( abcdef 小写)
	`%X`   无符号十六进制整数 ( ABCDEF 大写)
*/